<a href="https://colab.research.google.com/github/FabioCarlesso/ds-study-codes/blob/main/Codes/Pandas/PythonPandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

numeros = [i for i in range(11)]
letras = [chr(i + 65) for i in range(11)]
nome_coluna = ['N']

df = pd.DataFrame(data = numeros, index = letras, columns = nome_coluna)

selecao = df['N'].isin([i for i in range(11) if i % 2 == 0])
df = df[selecao]
df

    N
A   0
C   2
E   4
G   6
I   8
K  10

In [ ]:
numeros = [(9,6,3),(8,5,2),(7,4,1)]
letras = ['Z','Y','X']
nome_coluna = ['C','B','A']

df = pd.DataFrame(data = numeros, index = letras, columns = nome_coluna)
df

   C  B  A
Z  9  6  3
Y  8  5  2
X  7  4  1

In [ ]:
df.sort_index()
df.sort_index(axis = 1)
df

   C  B  A
Z  9  6  3
Y  8  5  2
X  7  4  1

In [ ]:
import pandas as pd
alunos = pd.DataFrame({'Nome': ['Ary', 'CÃ¡tia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6], 
                        'Aprovado': [True, False, False, True, True, True, False, False]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas', 'Aprovado'])
alunos

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
1   CÃ¡tia     27    F    2.5     False
2   Denis     56    M    5.0     False
3    Beto     32    M   10.0      True
4   Bruna     42    F    8.2      True
5    Dara     21    F    7.0      True
6  Carlos     19    M    6.0     False
7   Alice     35    F    5.6     False

In [ ]:
selecao = alunos['Aprovado'] == True
aprovados = alunos[selecao]
aprovados

    Nome  Idade Sexo  Notas  Aprovado
0    Ary     15    M    7.5      True
3   Beto     32    M   10.0      True
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [ ]:
selecao = (alunos.Aprovado == True) & (alunos.Sexo == 'F')
aprovados = alunos[selecao]
aprovados

    Nome  Idade Sexo  Notas  Aprovado
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [ ]:
selecao = (alunos.Idade > 10) & (alunos.Idade < 20) | (alunos.Idade >= 40)
grupos_idade = alunos[selecao]
grupos_idade

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
2   Denis     56    M    5.0     False
4   Bruna     42    F    8.2      True
6  Carlos     19    M    6.0     False

In [ ]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (8, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [ ]:
'l1 l2 l3 l4'.split() 
df['c1']

l1     1
l2     5
l3     8
l4    13
Name: c1, dtype: int64

In [ ]:
df[['c3','c1']]

    c3  c1
l1   3   1
l2   7   5
l3  11   8
l4  15  13

In [ ]:
df[:]

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [ ]:
df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12

In [ ]:
df[1:][['c3', 'c1']]

    c3  c1
l2   7   5
l3  11   8
l4  15  13

In [ ]:
df.loc['l3']

c1     8
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [ ]:
df.loc[['l3', 'l2']]

    c1  c2  c3  c4
l3   8  10  11  12
l2   5   6   7   8

In [ ]:
df.loc['l1', 'c2']

2

In [ ]:
df.iloc[0,1]

2

In [ ]:
df.loc[['l3', 'l1'], ['c4','c1']]

    c4  c1
l3  12   8
l1   4   1

In [ ]:
df.iloc[[2,0],[3,0]]

    c4  c1
l3  12   8
l1   4   1

In [ ]:
selecao = alunos['Aprovado'] == False
reprovados = alunos.loc[selecao, ['Nome', 'Sexo', 'Idade']]
reprovados

     Nome Sexo  Idade
1   CÃ¡tia    F     27
2   Denis    M     56
6  Carlos    M     19
7   Alice    F     35

In [ ]:
selecao = alunos['Aprovado'] == False
reprovados = alunos[['Nome', 'Sexo', 'Idade']][selecao]
reprovados

     Nome Sexo  Idade
1   CÃ¡tia    F     27
2   Denis    M     56
6  Carlos    M     19
7   Alice    F     35

In [ ]:
alunos.sort_values(by = ['Idade'], inplace = True)
alunos.iloc[:3]

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
6  Carlos     19    M    6.0     False
5    Dara     21    F    7.0      True

In [ ]:
imoveis = pd.DataFrame([['Apartamento', None, 970, 68], 
                        ['Apartamento', 2000, 878, 112], 
                        ['Casa', 5000, None, 500], 
                        ['Apartamento', None, 1010, 170], 
                        ['Apartamento', 1500, 850, None], 
                        ['Casa', None, None, None], 
                        ['Apartamento', 2000, 878, None], 
                        ['Apartamento', 1550, None, 228], 
                        ['Apartamento', 2500, 880, 195]], 
                        columns = ['Tipo', 'Valor', 'Condominio', 'IPTU'])
imoveis

          Tipo   Valor  Condominio   IPTU
0  Apartamento     NaN       970.0   68.0
1  Apartamento  2000.0       878.0  112.0
2         Casa  5000.0         NaN  500.0
3  Apartamento     NaN      1010.0  170.0
4  Apartamento  1500.0       850.0    NaN
5         Casa     NaN         NaN    NaN
6  Apartamento  2000.0       878.0    NaN
7  Apartamento  1550.0         NaN  228.0
8  Apartamento  2500.0       880.0  195.0

In [ ]:
imoveis.dropna(subset = ['Valor'], inplace = True)
imoveis

          Tipo   Valor  Condominio   IPTU
1  Apartamento  2000.0       878.0  112.0
2         Casa  5000.0         NaN  500.0
4  Apartamento  1500.0       850.0    NaN
6  Apartamento  2000.0       878.0    NaN
7  Apartamento  1550.0         NaN  228.0
8  Apartamento  2500.0       880.0  195.0

In [ ]:
selecao = (imoveis['Tipo'] == 'Apartamento') & (imoveis['Condominio'].isnull())
imoveis = imoveis[~selecao]
imoveis

          Tipo   Valor  Condominio   IPTU
1  Apartamento  2000.0       878.0  112.0
2         Casa  5000.0         NaN  500.0
4  Apartamento  1500.0       850.0    NaN
6  Apartamento  2000.0       878.0    NaN
8  Apartamento  2500.0       880.0  195.0

In [ ]:
imoveis = imoveis.fillna({'Condominio': 0, 'IPTU': 0})
imoveis

          Tipo   Valor  Condominio   IPTU
1  Apartamento  2000.0       878.0  112.0
2         Casa  5000.0         0.0  500.0
4  Apartamento  1500.0       850.0    0.0
6  Apartamento  2000.0       878.0    0.0
8  Apartamento  2500.0       880.0  195.0

In [ ]:
imoveis.index = range(imoveis.shape[0])
imoveis

          Tipo   Valor  Condominio   IPTU
0  Apartamento  2000.0       878.0  112.0
1         Casa  5000.0         0.0  500.0
2  Apartamento  1500.0       850.0    0.0
3  Apartamento  2000.0       878.0    0.0
4  Apartamento  2500.0       880.0  195.0

In [ ]:
atletas = pd.DataFrame([['Marcos', 9.62], ['Pedro', None], ['JoÃ£o', 9.69], 
                        ['Beto', 9.72], ['Sandro', None], ['Denis', 9.69], 
                        ['Ary', None], ['Carlos', 9.74]], 
                        columns = ['Corredor', 'Melhor Tempo'])
atletas

  Corredor  Melhor Tempo
0   Marcos          9.62
1    Pedro           NaN
2     JoÃ£o          9.69
3     Beto          9.72
4   Sandro           NaN
5    Denis          9.69
6      Ary           NaN
7   Carlos          9.74

In [ ]:
atletas.fillna(atletas.mean(), inplace = True)
atletas

  Corredor  Melhor Tempo
0   Marcos         9.620
1    Pedro         9.692
2     JoÃ£o         9.690
3     Beto         9.720
4   Sandro         9.692
5    Denis         9.690
6      Ary         9.692
7   Carlos         9.740

In [ ]:
alunos = pd.DataFrame({'Nome': ['Ary', 'CÃ¡tia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas'])
alunos

     Nome  Idade Sexo  Notas
0     Ary     15    M    7.5
1   CÃ¡tia     27    F    2.5
2   Denis     56    M    5.0
3    Beto     32    M   10.0
4   Bruna     42    F    8.2
5    Dara     21    F    7.0
6  Carlos     19    M    6.0
7   Alice     35    F    5.6

In [ ]:
alunos['Notas-MÃ©dia(Notas'] = alunos.Notas - alunos.Notas.mean()
alunos

     Nome  Idade Sexo  Notas  Notas-MÃ©dia(Notas
0     Ary     15    M    7.5              1.025
1   CÃ¡tia     27    F    2.5             -3.975
2   Denis     56    M    5.0             -1.475
3    Beto     32    M   10.0              3.525
4   Bruna     42    F    8.2              1.725
5    Dara     21    F    7.0              0.525
6  Carlos     19    M    6.0             -0.475
7   Alice     35    F    5.6             -0.875

In [ ]:
alunos['aixa EtÃ¡ria'] = alunos['Idade'].apply(lambda x: 'Menor que 20 anos' if x < 20 else ('Entre 20 e 40 anos' if (x >=20 and x <=40) else 'Maior que 40 anos') )
alunos

     Nome  Idade Sexo  Notas  Notas-MÃ©dia(Notas         aixa EtÃ¡ria
0     Ary     15    M    7.5              1.025   Menor que 20 anos
1   CÃ¡tia     27    F    2.5             -3.975  Entre 20 e 40 anos
2   Denis     56    M    5.0             -1.475   Maior que 40 anos
3    Beto     32    M   10.0              3.525  Entre 20 e 40 anos
4   Bruna     42    F    8.2              1.725   Maior que 40 anos
5    Dara     21    F    7.0              0.525  Entre 20 e 40 anos
6  Carlos     19    M    6.0             -0.475   Menor que 20 anos
7   Alice     35    F    5.6             -0.875  Entre 20 e 40 anos

In [ ]:
alunos['Notas-MÃ©dia(Notas)'] = alunos['Notas'].apply(lambda x: x - alunos['Notas'].mean())
alunos

     Nome  Idade  ...         aixa EtÃ¡ria  Notas-MÃ©dia(Notas)
0     Ary     15  ...   Menor que 20 anos               1.025
1   CÃ¡tia     27  ...  Entre 20 e 40 anos              -3.975
2   Denis     56  ...   Maior que 40 anos              -1.475
3    Beto     32  ...  Entre 20 e 40 anos               3.525
4   Bruna     42  ...   Maior que 40 anos               1.725
5    Dara     21  ...  Entre 20 e 40 anos               0.525
6  Carlos     19  ...   Menor que 20 anos              -0.475
7   Alice     35  ...  Entre 20 e 40 anos              -0.875

[8 rows x 7 columns]

In [ ]:
m1 = 'CCcCCccCCCccCcCccCcCcCCCcCCcccCCcCcCcCcccCCcCcccCc'
m2 = 'CCCCCccCccCcCCCCccCccccCccCccCCcCccCcCcCCcCccCccCc'
m3 = 'CccCCccCcCCCCCCCCCCcccCccCCCCCCccCCCcccCCCcCCcccCC'
m4 = 'cCCccCCccCCccCCccccCcCcCcCcCcCcCCCCccccCCCcCCcCCCC'
m5 = 'CCCcCcCcCcCCCcCCcCcCCccCcCCcccCccCCcCcCcCcCcccccCc'

eventos = {'m1': list(m1), 
            'm2': list(m2), 
            'm3': list(m3), 
            'm4': list(m4), 
            'm5': list(m5)}
moedas = pd.DataFrame(eventos)
df = pd.DataFrame(data = ['Cara', 'Coroa'], 
                    index = ['c', 'C'], 
                    columns = ['Faces'])
for item in moedas:
    df = pd.concat([df, moedas[item].value_counts()], 
                    axis = 1)
df

   Faces  m1  m2  m3  m4  m5
c   Cara  25  26  19  23  25
C  Coroa  25  24  31  27  25

In [ ]:
alunos = pd.DataFrame({'Nome': ['Ary', 'CÃ¡tia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6], 
                        'Aprovado': [True, False, False, True, True, True, False, False]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas', 'Aprovado'])
alunos

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
1   CÃ¡tia     27    F    2.5     False
2   Denis     56    M    5.0     False
3    Beto     32    M   10.0      True
4   Bruna     42    F    8.2      True
5    Dara     21    F    7.0      True
6  Carlos     19    M    6.0     False
7   Alice     35    F    5.6     False

In [ ]:
sexo = alunos.groupby('Sexo')
sexo = pd.DataFrame(sexo['Notas'].mean().round(2))
sexo.columns = ['Notas MÃ©dias']
sexo

      Notas MÃ©dias
Sexo
F             5.82
M             7.12

In [ ]:
precos = pd.DataFrame([['Feira', 'Cebola', 2.5], 
                        ['Mercado', 'Cebola', 1.99], 
                        ['Supermercado', 'Cebola', 1.69], 
                        ['Feira', 'Tomate', 4], 
                        ['Mercado', 'Tomate', 3.29], 
                        ['Supermercado', 'Tomate', 2.99], 
                        ['Feira', 'Batata', 4.2], 
                        ['Mercado', 'Batata', 3.99], 
                        ['Supermercado', 'Batata', 3.69]], 
                        columns = ['Local', 'Produto', 'PreÃ§o'])
precos

          Local Produto  PreÃ§o
0         Feira  Cebola   2.50
1       Mercado  Cebola   1.99
2  Supermercado  Cebola   1.69
3         Feira  Tomate   4.00
4       Mercado  Tomate   3.29
5  Supermercado  Tomate   2.99
6         Feira  Batata   4.20
7       Mercado  Batata   3.99
8  Supermercado  Batata   3.69

In [ ]:
produtos = precos.groupby('Produto')
produtos.describe().round(2)

        PreÃ§o
        count  mean   std   min   25%   50%   75%  max
Produto
Batata    3.0  3.96  0.26  3.69  3.84  3.99  4.10  4.2
Cebola    3.0  2.06  0.41  1.69  1.84  1.99  2.24  2.5
Tomate    3.0  3.43  0.52  2.99  3.14  3.29  3.64  4.0

In [ ]:
estatisticas = ['mean', 'std', 'min', 'max']
nomes = {'mean': 'MÃ©dia', 'std': 'Desvio PadrÃ£o', 'min': 'MÃ­nimo', 'max': 'MÃ¡ximo'}
produtos['PreÃ§o'].aggregate(estatisticas).rename(columns = nomes).round(2)

         MÃ©dia  Desvio PadrÃ£o  MÃ­nimo  MÃ¡ximo
Produto
Batata    3.96           0.26    3.69     4.2
Cebola    2.06           0.41    1.69     2.5
Tomate    3.43           0.52    2.99     4.0

In [ ]:
produtos['PreÃ§o'].agg(['mean', 'std'])

             mean       std
Produto
Batata   3.960000  0.256320
Cebola   2.060000  0.409512
Tomate   3.426667  0.518684

In [ ]:
%matplotlib inline
import pandas as pd
import matplotlib.pyplot as plt
plt.rc('figure', figsize = (15, 7))

# dados = pd.read_csv('dados/aluguel_amostra.csv', sep = ';')
# area = plt.figure()
# g1 = area.add_subplot(1, 2, 1)
# g2 = area.add_subplot(1, 2, 2)
# grupo1 = dados.groupby('Tipo Agregado')['Valor']
# label = grupo1.count().index
# valores = grupo1.count().values
# g1.pie(valores, labels = label, autopct='%1.1f%%')
# g1.set_title('Total de ImÃ³veis por Tipo Agregado')
# grupo2 = dados.groupby('Tipo')['Valor']
# label = grupo2.count().index
# valores = grupo2.count().values
# g2.pie(valores, labels = label, autopct='%1.1f%%', explode = (.1, .1, .1, .1, .1))
# g2.set_title('Total de ImÃ³veis por Tipo')

In [ ]:
dados = pd.DataFrame({'ProfissÃ£o': [1, 2, 3, 1, 2, 2, 2, 3, 3, 2, 1, 3]})
dados

    ProfissÃ£o
0           1
1           2
2           3
3           1
4           2
5           2
6           2
7           3
8           3
9           2
10          1
11          3

In [ ]:
frequencia = dados['ProfissÃ£o'].value_counts()
percentual = dados['ProfissÃ£o'].value_counts(normalize = True) * 100
dist_freq_qualitativas = pd.DataFrame({'FrequÃªncia': frequencia, 'Porcentagem (%)': percentual})
dist_freq_qualitativas.rename(index = {1: 'EstatÃ­stico', 2: 'Cientista de Dados', 3: 'Programador Python'}, inplace = True)
dist_freq_qualitativas.rename_axis('ProfissÃ£o', axis= 'columns', inplace = True)
dist_freq_qualitativas

ProfissÃ£o           FrequÃªncia  Porcentagem (%)
Cientista de Dados           5        41.666667
Programador Python           4        33.333333
EstatÃ­stico                  3        25.000000